SELECT "s_СЛУЖАЩИЕ"."ТАБЕЛЬНЫЙ_НОМЕР",
       "s_СЛУЖАЩИЕ"."ФАМИЛИЯ" || ' ' || LEFT("s_СЛУЖАЩИЕ"."ИМЯ", 1) || '.' || LEFT("s_СЛУЖАЩИЕ"."ОТЧЕСТВО", 1) AS "ФИО_сотрудника",
       "s_СЛУЖАЩИЕ"."ПОЛ",
       "s_СЛУЖАЩИЕ"."ДЕНЬ_РОЖДЕНИЯ",
       DATE_PART('YEAR', AGE(CURRENT_DATE, "s_СЛУЖАЩИЕ"."ДЕНЬ_РОЖДЕНИЯ")) AS "Возраст_сотрудника",
       DATE_PART('YEAR', AGE(CURRENT_DATE, (SELECT MIN("s_СЛУЖАЩИЕ"."ДЕНЬ_РОЖДЕНИЯ")
                          FROM "s_СЛУЖАЩИЕ"
                                   JOIN "s_ДЕТИ_СОТРУДНИКОВ" ON "s_СЛУЖАЩИЕ"."ТАБЕЛЬНЫЙ_НОМЕР" = "s_ДЕТИ_СОТРУДНИКОВ"."СЛУЖАЩИЙ_ИД")) -
       AGE(CURRENT_DATE, "s_СЛУЖАЩИЕ"."ДЕНЬ_РОЖДЕНИЯ")) AS "Отклонение_максимального_возраста"
FROM "s_СЛУЖАЩИЕ"
WHERE "s_СЛУЖАЩИЕ"."СПЕЦИАЛЬНОСТЬ_ИД" = (SELECT "СПЕЦИАЛЬНОСТЬ_ИД"
                                         FROM "s_СЛУЖАЩИЕ"
                                                  JOIN "s_ДЕТИ_СОТРУДНИКОВ" ON "s_СЛУЖАЩИЕ"."ТАБЕЛЬНЫЙ_НОМЕР" = "s_ДЕТИ_СОТРУДНИКОВ"."СЛУЖАЩИЙ_ИД"
                                         ORDER BY "s_СЛУЖАЩИЕ"."ДЕНЬ_РОЖДЕНИЯ" ASC
                                         LIMIT 1);
